In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Dataset_05.csv")

In [3]:
df.head(2)

,ID,Age,Age_gr,Gender,Work_Experience,Family_Size,Ever_Married,Graduated,Profession,Spending_Score,Var_1,Segmentation
0,462809,22,30,1,1.0,4.0,1,1,6,2,4,NaN
1,462643,38,40,0,NaN,3.0,2,2,3,0,4,A

In [5]:
df.isna().sum().sum()

1166

In [49]:
df.dropna()

,ID,Age,Age_gr,Gender,Work_Experience,Family_Size,Ever_Married,Graduated,Profession,Spending_Score,Var_1,Segmentation
3,461735,67,70,1,0.0,2.0,2,2,8,1,6,B
5,461319,56,60,1,0.0,2.0,2,1,1,0,6,C
6,460156,32,40,1,1.0,3.0,1,2,6,2,6,C
7,464347,33,40,0,1.0,3.0,1,2,6,2,6,D
8,465015,61,70,0,0.0,3.0,2,2,3,2,7,D
...,...,...,...,...,...,...,...,...,...,...,...,...
8063,464018,22,30,1,0.0,7.0,1,1,0,2,1,D
8064,464685,35,40,1,3.0,4.0,1,1,5,2,4,D
8065,465406,33,40,0,1.0,1.0,1,2,6,2,6,D
8066,467299,27,30,0,1.0,4.0,1,2,6,2,6,B
8067,461879,37,40,1,0.0,3.0,2,2,5,0,4,B

In [45]:
df2=pd.read_csv("Dataset_02.csv")

In [46]:
df2.head(2)

   Age Sex    BP Cholesterol  Na_to_K   Drug
0   23   F  HIGH        HIGH   25.355  DrugY
1   47   M   LOW        HIGH   13.093  drugC

In [73]:
df.head(2)
df=df.dropna()

In [74]:
from scipy.stats import chi2_contingency

In [75]:
chi2_contingency(pd.crosstab(df['Gender'],df['Segmentation']))

(13.84425336760869,
 0.003125001283622576,
 3,
 array([[ 763.27156595,  735.31950624,  802.04377781,  840.36514999],
        [ 929.72843405,  895.68049376,  976.95622219, 1023.63485001]]))

In [120]:
df1=df.loc[(df['Segmentation']=='A')|(df['Segmentation']=='D')]

In [121]:
from sklearn.model_selection import train_test_split

In [122]:
train, test = train_test_split(df1, test_size=0.3, random_state=123 )

In [123]:
from sklearn.tree import DecisionTreeClassifier

In [124]:
var=['Age_gr', 'Gender','Work_Experience', 'Family_Size','Ever_Married','Graduated', 'Spending_Score']

In [125]:
model = DecisionTreeClassifier(max_depth=7).fit(X = train[var], 
                             y = train.Segmentation)

In [126]:
pred = model.predict(test[var])

In [127]:
from sklearn.metrics import classification_report

In [128]:
print(classification_report(test['Segmentation'], pred))

              precision    recall  f1-score   support

           A       0.63      0.78      0.70       503
           D       0.75      0.59      0.66       565

    accuracy                           0.68      1068
   macro avg       0.69      0.69      0.68      1068
weighted avg       0.69      0.68      0.68      1068

In [129]:
df=pd.read_csv("Dataset_06.csv")

In [130]:
df.head(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,sqft_living15,sqft_lot15
0,2597000006,20150309T000000,347500.0,3,1.50,1180,8353,1.0,0,0,3,7,1180,0,1960,0,98155,1710,8748
1,8813400345,20150414T000000,575000.0,2,1.00,980,3663,1.0,0,0,5,7,980,0,1909,0,98105,1620,3706
2,226059106,20150102T000000,489500.0,3,1.75,2090,65558,1.0,0,0,3,8,1330,760,1977,0,98072,2450,47178

In [135]:
df1 = df.loc[df['waterfront']==1, 'price'].mean()

In [136]:
df2 = df.loc[df['waterfront']==0, 'price'].mean()

In [137]:
df2 - df1

-1167272.748018648

In [150]:
var=['price', 'bedrooms','bathrooms','sqft_living','sqft_lot','floors','yr_built']

In [151]:
df3 = df[var]

In [152]:
df3.head(2)

      price  bedrooms  bathrooms  sqft_living  sqft_lot  floors  yr_built
0  347500.0         3        1.5         1180      8353     1.0      1960
1  575000.0         2        1.0          980      3663     1.0      1909

In [154]:
p = df3.corr()

In [169]:
p.iloc[:,0].reset_index()

         index     price
0        price  1.000000
1     bedrooms  0.279824
2    bathrooms  0.534277
3  sqft_living  0.709157
4     sqft_lot  0.106341
5       floors  0.270423
6     yr_built  0.059895

In [170]:
df.head(2)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,sqft_living15,sqft_lot15
0,2597000006,20150309T000000,347500.0,3,1.5,1180,8353,1.0,0,0,3,7,1180,0,1960,0,98155,1710,8748
1,8813400345,20150414T000000,575000.0,2,1.0,980,3663,1.0,0,0,5,7,980,0,1909,0,98105,1620,3706

In [209]:
df1 = df.drop(columns=['id'])

In [210]:
df1 = df1.drop(columns=['date'])

In [211]:
df1 = df1.drop(columns=['zipcode'])

In [212]:
df1.head(2)

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,sqft_living15,sqft_lot15
0,347500.0,3,1.5,1180,8353,1.0,0,0,3,7,1180,0,1960,0,1710,8748
1,575000.0,2,1.0,980,3663,1.0,0,0,5,7,980,0,1909,0,1620,3706

In [194]:
from sklearn.linear_model import LinearRegression

In [221]:
model=LinearRegression().fit(X=df1,y=df1.price)

In [220]:
model.coef_

array([ 1.00000000e+00, -5.13501569e-12, -2.82224579e-11,  1.07372841e-14,
        2.12500073e-16,  8.12932138e-12,  1.13426492e-10, -9.67780024e-12,
        1.27782782e-12,  1.45130574e-13,  4.34658324e-15,  6.39229433e-15,
        3.78260457e-15, -9.27675768e-16, -5.15277556e-17,  2.36828625e-17])

In [205]:
model.stat

AttributeError: 'LinearRegression' object has no attribute 'stat'